# DataFrames

In [8]:
import numpy as np
import pandas as pd

In [2]:
filas = ["ventas1","ventas2","ventas3"]
columnas = ["zonaA","zonaB","zonaC"]
datos = [[123,4123,123],[123,41,231],[135,213,612]]

In [3]:
dataframe = pd.DataFrame(datos,filas,columnas)

In [4]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123   4123    123
ventas2    123     41    231
ventas3    135    213    612

In [5]:
dataframe.loc[["ventas1","ventas2"]]

         zonaA  zonaB  zonaC
ventas1    123   4123    123
ventas2    123     41    231

In [6]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123   4123    123
ventas2    123     41    231
ventas3    135    213    612

In [7]:
dataframe["zonaA"]

ventas1    123
ventas2    123
ventas3    135
Name: zonaA, dtype: int64

In [8]:
dataframe.loc["ventas1"]["zonaA"]

123

In [9]:
dataframe["Total"] = dataframe["zonaA"] + dataframe["zonaB"] + dataframe["zonaC"] 
dataframe

         zonaA  zonaB  zonaC  Total
ventas1    123   4123    123   4369
ventas2    123     41    231    395
ventas3    135    213    612    960

In [10]:
dataframe.drop("Total",axis=1) #axis =1 significa que es una columna. el .drop es solo visual

         zonaA  zonaB  zonaC
ventas1    123   4123    123
ventas2    123     41    231
ventas3    135    213    612

In [11]:
dataframe

         zonaA  zonaB  zonaC  Total
ventas1    123   4123    123   4369
ventas2    123     41    231    395
ventas3    135    213    612    960

In [13]:
dataframe.drop("Total",axis=1, inplace=True) #el inplace hace que la elimine del dataframe

In [14]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123   4123    123
ventas2    123     41    231
ventas3    135    213    612

In [15]:
dataframe.drop("ventas3")     #por defecto el axis es igual a 0

         zonaA  zonaB  zonaC
ventas1    123   4123    123
ventas2    123     41    231

In [17]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123   4123    123
ventas2    123     41    231
ventas3    135    213    612

In [19]:
dataframe.shape #ver el tamaño

(3, 3)

# Selección de datos

In [22]:
filas = "ventas1 ventas2 ventas3".split()
filas

['ventas1', 'ventas2', 'ventas3']

In [24]:
columnas = "zonaA zonaB zonaC".split()
columnas

['zonaA', 'zonaB', 'zonaC']

In [33]:
datos = [list(np.random.randint(0,1000,3)),list(np.random.randint(0,1000,3)),list(np.random.randint(0,1000,3))]
datos

[[758, 634, 951], [238, 681, 178], [194, 387, 178]]

In [34]:
dataframe = pd.DataFrame(datos,filas,columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    758    634    951
ventas2    238    681    178
ventas3    194    387    178

In [35]:
condicion = dataframe > 200

In [36]:
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1  758.0    634  951.0
ventas2  238.0    681    NaN
ventas3    NaN    387    NaN

In [39]:
condicion = dataframe["zonaA"] >200
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    758    634    951
ventas2    238    681    178

In [42]:
condicion = (dataframe["zonaA"] >200) & (dataframe["zonaB"] >650)
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas2    238    681    178

# Modificando nombre de las filas

In [4]:
import numpy as np

In [5]:
filas = "ventas1 ventas2 ventas3".split()
filas

['ventas1', 'ventas2', 'ventas3']

In [6]:
columnas = "zonaA zonaB zonaC".split()
columnas

['zonaA', 'zonaB', 'zonaC']

In [7]:
datos = [list(np.random.randint(0,1000,3)),list(np.random.randint(0,1000,3)),list(np.random.randint(0,1000,3))]
datos

[[732, 840, 407], [134, 600, 406], [755, 426, 852]]

In [11]:
dataframe = pd.DataFrame(datos,filas,columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    732    840    407
ventas2    134    600    406
ventas3    755    426    852

In [12]:
nuevas_filas = "dia1 dia2 dia3".split()

In [13]:
#vamos a sustituir ventas1 , 2 y 3 por dia1, dia2 y dia3

In [14]:
dataframe["dias"] = nuevas_filas

In [15]:
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    732    840    407  dia1
ventas2    134    600    406  dia2
ventas3    755    426    852  dia3

In [16]:
dataframe.set_index("dias")

      zonaA  zonaB  zonaC
dias
dia1    732    840    407
dia2    134    600    406
dia3    755    426    852

In [17]:
dataframe

         zonaA  zonaB  zonaC  dias
ventas1    732    840    407  dia1
ventas2    134    600    406  dia2
ventas3    755    426    852  dia3

In [18]:
dataframe = dataframe.set_index("dias")

In [19]:
dataframe

      zonaA  zonaB  zonaC
dias
dia1    732    840    407
dia2    134    600    406
dia3    755    426    852